backend/load-tests/cache_hot_results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: scenarios/cache_hot.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 30s over 2 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  01.0s/30.0s

running (0m02.0s), 02/10 VUs, 27 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  02.0s/30.0s

running (0m03.0s), 03/10 VUs, 54 complete and 0 interrupted iterations
default   [  10% ] 03/10 VUs  03.0s/30.0s

running (0m04.0s), 04/10 VUs, 89 complete and 0 interrupted iterations
default   [  13% ] 04/10 VUs  04.0s/30.0s

running (0m05.0s), 05/10 VUs, 133 complete and 0 interrupted iterations
default   [  17% ] 05/10 VUs  05.0s/30.0s

running (0m06.0s), 06/10 VUs, 186 complete and 0 interrupted iterations
default   [  20% ] 06/10 VUs  06.0s/30.0s

running (0m07.0s), 07/10 VUs, 248 complete and 0 interrupted iterations
default   [  23% ] 07/10 VUs  07.0s/30.0s

running (0m08.0s), 08/10 VUs, 316 complete and 0 interrupted iterations
default   [  27% ] 08/10 VUs  08.0s/30.0s

running (0m09.0s), 09/10 VUs, 396 complete and 0 interrupted iterations
default   [  30% ] 09/10 VUs  09.0s/30.0s

running (0m10.0s), 09/10 VUs, 484 complete and 0 interrupted iterations
default   [  33% ] 09/10 VUs  10.0s/30.0s

running (0m11.0s), 10/10 VUs, 582 complete and 0 interrupted iterations
default   [  37% ] 10/10 VUs  11.0s/30.0s

running (0m12.0s), 10/10 VUs, 678 complete and 0 interrupted iterations
default   [  40% ] 10/10 VUs  12.0s/30.0s

running (0m13.0s), 10/10 VUs, 777 complete and 0 interrupted iterations
default   [  43% ] 10/10 VUs  13.0s/30.0s

running (0m14.0s), 10/10 VUs, 874 complete and 0 interrupted iterations
default   [  47% ] 10/10 VUs  14.0s/30.0s

running (0m15.0s), 10/10 VUs, 972 complete and 0 interrupted iterations
default   [  50% ] 10/10 VUs  15.0s/30.0s

running (0m16.0s), 10/10 VUs, 1068 complete and 0 interrupted iterations
default   [  53% ] 10/10 VUs  16.0s/30.0s

running (0m17.0s), 10/10 VUs, 1167 complete and 0 interrupted iterations
default   [  57% ] 10/10 VUs  17.0s/30.0s

running (0m18.0s), 10/10 VUs, 1259 complete and 0 interrupted iterations
default   [  60% ] 10/10 VUs  18.0s/30.0s

running (0m19.0s), 10/10 VUs, 1349 complete and 0 interrupted iterations
default   [  63% ] 10/10 VUs  19.0s/30.0s

running (0m20.0s), 10/10 VUs, 1440 complete and 0 interrupted iterations
default   [  67% ] 10/10 VUs  20.0s/30.0s

running (0m21.0s), 10/10 VUs, 1532 complete and 0 interrupted iterations
default   [  70% ] 10/10 VUs  21.0s/30.0s

running (0m22.0s), 10/10 VUs, 1623 complete and 0 interrupted iterations
default   [  73% ] 10/10 VUs  22.0s/30.0s

running (0m23.0s), 10/10 VUs, 1713 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  23.0s/30.0s

running (0m24.0s), 10/10 VUs, 1805 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  24.0s/30.0s

running (0m25.0s), 10/10 VUs, 1891 complete and 0 interrupted iterations
default   [  83% ] 10/10 VUs  25.0s/30.0s

running (0m26.0s), 10/10 VUs, 1980 complete and 0 interrupted iterations
default   [  87% ] 10/10 VUs  26.0s/30.0s

running (0m27.0s), 10/10 VUs, 2070 complete and 0 interrupted iterations
default   [  90% ] 10/10 VUs  27.0s/30.0s

running (0m28.0s), 10/10 VUs, 2160 complete and 0 interrupted iterations
default   [  93% ] 10/10 VUs  28.0s/30.0s

running (0m29.0s), 10/10 VUs, 2249 complete and 0 interrupted iterations
default   [  97% ] 10/10 VUs  29.0s/30.0s

running (0m30.0s), 10/10 VUs, 2344 complete and 0 interrupted iterations
default   [ 100% ] 10/10 VUs  30.0s/30.0s
time="2026-02-10T09:25:27+08:00" level=info msg="\n=== CACHE HOT TEST ===" source=console
time="2026-02-10T09:25:27+08:00" level=info msg="ENABLE_RESPONSE_CACHE=true" source=console
time="2026-02-10T09:25:27+08:00" level=info msg="Same page repeated: page=1" source=console
time="2026-02-10T09:25:27+08:00" level=info msg="\nHTTP Request Duration:" source=console
time="2026-02-10T09:25:27+08:00" level=info msg="  avg:  3.03ms" source=console
time="2026-02-10T09:25:27+08:00" level=error msg="TypeError: Cannot read property 'toFixed' of undefined or null\n\tat handleSummary (file:///C:/Users/hitech/Desktop/Full%20Stack%20React%20Project/AdminUI/AllDone-Ecommerce-Platform/ecommerce-platform/backend/load-tests/scenarios/cache_hot.js:78:45(82))\n" hint="script exception"


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 4710    156.465573/s
    checks_succeeded...: 100.00% 4710 out of 4710
    checks_failed......: 0.00%   0 out of 4710

    ✓ status is 200
    ✓ has products

    CUSTOM
    cache_hits.....................: 2355   78.232787/s
    perf_db_ms.....................: avg=0s       min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s      
    perf_total_ms..................: avg=14.43µs  min=0s       med=0s       max=1ms      p(90)=0s      p(95)=0s      

    HTTP
    http_req_duration..............: avg=3.03ms   min=0s       med=1.82ms   max=56.57ms  p(90)=6.51ms  p(95)=8.59ms  
      { expected_response:true }...: avg=3.03ms   min=0s       med=1.82ms   max=56.57ms  p(90)=6.51ms  p(95)=8.59ms  
    http_req_failed................: 0.00%  0 out of 2355
    http_reqs......................: 2355   78.232787/s

    EXECUTION
    iteration_duration.............: avg=106.38ms min=100.74ms med=103.35ms max=158.79ms p(90)=114.3ms p(95)=120.39ms
    iterations.....................: 2355   78.232787/s
    vus............................: 10     min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 14 MB  459 kB/s
    data_sent......................: 391 kB 13 kB/s



running (0m30.1s), 00/10 VUs, 2355 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  30s